<script>
    import BookImg from '../img/book.png'
    import HouseImg from '../img/house.png'
    import WinterGardenImg from '../img/winterGarden.png'
</script>

<div id="wrapper">
    <p>
        06:00 Выезд из Минска. Переезд в Ветка. Путевая информация, где мы поговорим про хронику освобождения Беларуси, о начале проведения стратегической наступательной операции Багратион, о людях фронта и советских военачальниках.
    </p>
    <p>
        Посещение Ветковской школы. Проведение мероприятий, посвященных освобождению Беларуси с участием Гимназии №40 г. Минска.
    </p>

    <div><img src={BookImg} alt="Книга"></div>

    <p>
        После основного мероприятия мы посетим 
        Ветковский музей старообрядчества и 
        белорусских традиций сегодня 
        (входит в стоимость) - 
        научно-исследовательский и 
        просветительский центр региона в области 
        традиционной культуры. Здесь нас ждет 
        экскурсия, в ходе которой мы познакомимся 
        с художественной культурой и творчеством 
        нескольких народных традиций региона на 
        юго-востоке Беларуси. Коллекции уникальных 
        старообрядческих икон, рукописных и 
        печатных книг, самая большая коллекция 
        регионального текстиля (рушники, элементы 
        традиционного костюма и др.) делают 
        Ветковский музей уникальным явлением в 
        белорусской и старообрядческой культуре.
    </p>

    <p>Обед в кафе (дополнительная оплата или самостоятельно).</p>

    <div><img src={HouseImg} alt="Дом"></div>

    <p>Далее мы отправимся на автобусно-пешеходную экскурсию по Гомелю (входит в стоимость). Мы с вами увидим основные три центральные улицы, которые образуют «треугольник».	Посмотрим значимые достопримечательности. Начнем с центральной площади Гомеля - площади Ленина. Мы познакомимся с историей формирования проспектов Ленина и Победы, которые лучами расходятся от вокзала. На проспекте Ленина ознакомимся со зданиями сталинского ампира и увидим идеал ноу-хау 1930 - Дом-коммуну (после кап. ремонта самый элитный дом Гомеля 2000). А вы знали, что когда-то на месте нынешнего проспекта Победы располагалось болото? Об этом и о многом другом вам предстоит узнать на нашей экскурсии. Дальше с историей города мы будем знакомиться на площади Восстания. Узнаем то, чего не знает почти ни один гомельчанин - в память какого восстания была названа эта площадь. Вы узнаете о лагере смерти, который немцы обустроили здесь во время Великой Отечественной войны. Побеседуем об истории улицы Советской.</p>
    <p>Приехать в Гомель и не посмотреть Дворцово-парковый ансамбль Румянцевых-Паскевичей просто невозможно -поэтому здесь нас ждет экскурсия во Дворец Румянцевых и Паскевичей (входит в стоимость). Это то место, с которого и началась перестройка. Также, мы увидим самые живописные уголки в городском парке. Прогуляемся к небольшой Лебяжьему пруду, увидим белок и узнаем, чьи привидения охраняют парк по ночам.</p>
    <div class="space-between">
        <div id="jungles">
            <img src={WinterGardenImg} alt="Джунгли">
        </div>
        <div class="fact">
            <p class="fact__header">Интересно знать</p>
            <p class="fact__text">
                С 1840-го года в здание Зимнего сада располагался один из корпусов сахарного завода. Для отвода продуктов горения на высоком берегу реки Сож была возведена высокая кирпичная вытяжная труба. По желанию владельца имения Федора Ивановича Паскевича производство сладкого продукта перешло в Добруш. И в начале 1880-х годов постройки сахарного завода были частично переоборудованы и приспособлены под объекты паркового назначения, которыми являются и в настоящее время. В наземном производственном корпусе разместилась оранжерея - Зимний сад, вытяжная труба после реконструкции стала использоваться как Башня обозрения. Вместе со смотровой площадкой и шпилем над ней высота сооружения достигает 40 метров.
            </p>
        </div>
    </div>

    <p>Рекомендуем для самостоятельного посещения по желанию (дополнительная оплата): Зимний сад и Башня обозрения. Эти два сооружения, разделенные некоторым расстоянием, тем не менее, связаны общей историей, которая восходит к середине 19 века. Башня обозрения выполняла роль паркового объекта на протяжении всего советского периода. В годы Великой Отечественной войны строение пострадало от обстрелов. Следы попадания осколков и пуль сохранились до настоящего времени.</p>
    <p>В свободное время можно будет по желанию посетить кофейню города, где готовят золотой капучино (доп. оплата по желанию).</p>
    <p>Выезд в Минск. Прибытие в Минск поздним вечером.</p>
</div>

<style>
    #wrapper {
        max-width: 1440px;
        margin: 0 auto;
        display: flex;
        flex-direction: column;
        align-items: center;
        gap: 1rem;
        padding: 0 2.5rem 1rem;
    }

    p {
        font-family: 'Montserrat', sans-serif;
        font-size: 1rem;
        font-weight: 400;
        width: 100%;
        margin: 0;
    }

    .space-between {
        display: flex;
        justify-content: space-between;
        width: 100%;
        gap: 1rem;
    }

    #jungles {
        max-width: 643.25px;
        height: auto;
    }

    #jungles img {
        width: 100%;
    }

    .fact {
        padding: 0.625rem;
        border-radius: 1.25rem;
        border: 2px solid red;
        max-width: 25rem;
        text-align: center;
    }

    .fact__header {
        text-transform: uppercase;
        font-weight: 700;
        margin-bottom: 1rem;
    }

    @media (max-width: 1100px) {
        .space-between {
            flex-direction: column;
            align-items: center;
        }

        .fact {
            width: 100%;
        }
    }
</style>